"""
За день машина проезжает n километров.
Сколько дней нужно, чтобы проехать маршрут длиной m километров?
При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.
Input:
n = 700
m = 750
Output:
2
"""
# try:
#
#     n = int(input('Сколько проезжает машина за день: '))
#     m = int(input('Длинна маршрута: '))
#     t = 1
#
#     if n % m != 0:
#         t = m / n + 1
#     else:
#         t = m / n
#     print(int(t))
# except:
#     print('Вы ввели не корректные данные')

"""
В некоторой школе решили набрать три новых математических класса и оборудовать кабинеты для них новыми партами. 
За каждой партой может сидеть два учащихся. Известно количество учащихся в каждом из трех классов. 
Выведите наименьшее число парт, которое нужно приобрести для них.
Input: 20 21 22(ввод чисел НЕ в одну строку)
Output: 32
"""
# class_1 = int(input('Количество учащихся в классе 1: '))
# class_2 = int(input('Количество учащихся в классе 2: '))
# class_3 = int(input('Количество учащихся в классе 3: '))
# person = 2
# n = class_1 + class_2 + class_3
# print(round(n / 2))

# import math
#
# vvod_1 = int(input("Введите количестко учеников в 1 классе"))
# vvod_2 = int(input("Введите количестко учеников в 2 классе"))
# vvod_3 = int(input("Введите количестко учеников в 3 классе"))
#
# print(math.ceil((vvod_1+vvod_2+vvod_3)/2))

"""
Вагоны в электричке пронумерованы натуральными числами, 
начиная с 1 (при этом иногда вагоны нумеруются от «головы» поезда, а иногда – с «хвоста»; 
это зависит от того, в какую сторону едет электричка). 
В каждом вагоне написан его номер. 
Витя сел в i-й вагон от головы поезда и обнаружил, что его вагон имеет номер j. 
Он хочет определить, сколько всего вагонов в электричке. Напишите программу, 
которая будет это делать или сообщать, что без дополнительной информации это сделать невозможно.
Input: 3 4(ввод на разных строках)
Output: 6
"""



